Indicates if Analytical Model supports Rigid Links.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public bool CanHaveRigidLinks()
  Visual Basic
Public Function CanHaveRigidLinks As Boolean
  Visual C++
public:
bool CanHaveRigidLinks()
 Return Value
 True if Analytical Model supports Rigid Links; false otherwise.
 See Also
  AnalyticalModel Class
  Autodesk.Revit.DB.Structure Namespace